PanBabinicz/arm_assembly/share/stm32f446re_constants.inc
    .syntax unified
    .cpu cortex-m4
    .thumb


    @-------------------------------------------------------------------------------------------@
    @---------------------------------- RCC registers offsets ----------------------------------@
    @-------------------------------------------------------------------------------------------@

    .equ rcc_ahb1enr_base,      (0x40023830)    @ RCC register boundary address

    .equ rcc_cr_offset,         (0x00)          @ RCC Clock control register
    .equ rcc_pllcfgr_offset,    (0x04)          @ RCC PLL configuration register
    .equ rcc_cfgr_offset,       (0x08)          @ RCC Clock configuration register
    .equ rcc_cir_offset,        (0x0c)          @ RCC Clock interrupt register

    .equ rcc_ahb1rstr_offset,   (0x10)          @ RCC AHB1 peripheral reset register
    .equ rcc_ahb2rstr_offset,   (0x14)          @ RCC AHB2 peripheral reset register
    .equ rcc_ahb3rstr_offset,   (0x18)          @ RCC AHB3 peripheral reset register

    .equ rcc_apb1rstr_offset,   (0x20)          @ RCC APB1 peripheral reset register
    .equ rcc_apb2rstr_offset,   (0x24)          @ RCC APB2 peripheral reset register

    .equ rcc_ahb1enr_offset,    (0x30)          @ RCC AHB1 peripheral clock enable register
    .equ rcc_ahb2enr_offset,    (0x34)          @ RCC AHB2 peripheral clock enable register
    .equ rcc_ahb3enr_offset,    (0x38)          @ RCC AHB3 peripheral clock enable register

    .equ rcc_apb1enr_offset,    (0x40)          @ RCC APB1 peripheral clock enable register
    .equ rcc_apb2enr_offset,    (0x44)          @ RCC APB2 peripheral clock enable register

    .equ rcc_ahb1lpenr_offset,  (0x50)          @ RCC AHB1 peripheral clock enable in low
                                                @ power mode register

    .equ rcc_ahb2lpenr_offset,  (0x54)          @ RCC AHB2 peripheral clock enable in low
                                                @ power mode register

    .equ rcc_ahb3lpenr_offset,  (0x58)          @ RCC AHB3 peripheral clock enable in low
                                                @ power mode register

    .equ rcc_apb1lpenr_offset,  (0x60)          @ RCC APB1 peripheral clock enable in low
                                                @ power mode register

    .equ rcc_apb2lpenr_offset,  (0x64)          @ RCC APB2 peripheral clock enable in low
                                                @ power mode register

    .equ rcc_bdcr_offset,       (0x70)          @ RCC Backup domain control register
    .equ rcc_csr_offset,        (0x74)          @ RCC Clock control & status register

    .equ rcc_sscgr_offset,      (0x80)          @ RCC Spread specturm clock generation register
    .equ rcc_plli2scfgr_offset, (0x84)          @ RCC PLLI2S configuration register
    .equ rcc_pllsaicfgr_offset, (0x88)          @ RCC PLL configuration register
    .equ rcc_dckcfgr_offset,    (0x8c)          @ RCC Dedicated clock configuration register

    .equ rcc_ckgatenr_offset,   (0x90)          @ RCC clocks gated enable register
    .equ rcc_dckcfgr2_offset,   (0x94)          @ RCC Dedicated clocks configuration register 2
    

    @-------------------------------------------------------------------------------------------@
    @---------------------------------- RCC CR register fields ---------------------------------@
    @-------------------------------------------------------------------------------------------@

    .equ rcc_cr_hsion_position,             (0x00)
    .equ rcc_cr_hsion_mask,                 (0x01 << rcc_cr_hsion_position)
    .equ rcc_cr_hsion,                      (rcc_cr_hsion_mask)

    .equ rcc_cr_hsirdy_position,            (0x01)
    .equ rcc_cr_hsirdy_mask,                (0x01 << rcc_cr_hsirdy_position)
    .equ rcc_cr_hsirdy,                     (rcc_cr_hsirdy_mask)

    .equ rcc_cr_hsitrim_position,           (0x03)
    .equ rcc_cr_hsitrim_mask,               (0x1f << rcc_cr_hsitrim_position)
    .equ rcc_cr_hsitrim,                    (rcc_cr_hsitrim_mask)
    .equ rcc_cr_hsitrim_bit0,               (0x01 << rcc_cr_hsitrim_position)
    .equ rcc_cr_hsitrim_bit1,               (0x02 << rcc_cr_hsitrim_position)
    .equ rcc_cr_hsitrim_bit2,               (0x04 << rcc_cr_hsitrim_position)
    .equ rcc_cr_hsitrim_bit3,               (0x08 << rcc_cr_hsitrim_position)
    .equ rcc_cr_hsitrim_bit4,               (0x10 << rcc_cr_hsitrim_position)

    .equ rcc_cr_hsical_position,            (0x08)
    .equ rcc_cr_hsical_mask,                (0xff << rcc_cr_hsical_position)
    .equ rcc_cr_hsical,                     (rcc_cr_hsical_mask)
    .equ rcc_cr_hsical_bit0,                (0x01 << rcc_cr_hsical_position)
    .equ rcc_cr_hsical_bit1,                (0x02 << rcc_cr_hsical_position)
    .equ rcc_cr_hsical_bit2,                (0x04 << rcc_cr_hsical_position)
    .equ rcc_cr_hsical_bit3,                (0x08 << rcc_cr_hsical_position)
    .equ rcc_cr_hsical_bit4,                (0x10 << rcc_cr_hsical_position)
    .equ rcc_cr_hsical_bit5,                (0x20 << rcc_cr_hsical_position)
    .equ rcc_cr_hsical_bit6,                (0x40 << rcc_cr_hsical_position)
    .equ rcc_cr_hsical_bit7,                (0x80 << rcc_cr_hsical_position)

    .equ rcc_cr_hseon_position,             (0x10)
    .equ rcc_cr_hseon_mask,                 (0x01 << rcc_cr_hseon_position)
    .equ rcc_cr_hseon,                      (rcc_cr_hseon_mask)

    .equ rcc_cr_hserdy_position,            (0x11)
    .equ rcc_cr_hserdy_mask,                (0x01 << rcc_cr_hserdy_position)
    .equ rcc_cr_hserdy,                     (rcc_cr_hserdy_mask)

    .equ rcc_cr_hsebyp_position,            (0x12)
    .equ rcc_cr_hsebyp_mask,                (0x01 << rcc_cr_hsebyp_position)
    .equ rcc_cr_hsebyp,                     (rcc_cr_hsebyp_mask)

    .equ rcc_cr_csson_position,             (0x13)
    .equ rcc_cr_csson_mask,                 (0x01 << rcc_cr_csson_position)
    .equ rcc_cr_csson,                      (rcc_cr_csson_mask)

    .equ rcc_cr_pllon_position,             (0x18)
    .equ rcc_cr_pllon_mask,                 (0x01 << rcc_cr_pllon_position)
    .equ rcc_cr_pllon,                      (rcc_cr_pllon_mask)

