PanBabinicz/arm_assembly/share/stm32f446re_constants.inc
    .equ rcc_ahb1enr_gpiofen_position,      (0x05)
    .equ rcc_ahb1enr_gpiofen_mask,          (0x01 << rcc_ahb1enr_gpiofen_position)
    .equ rcc_ahb1enr_gpiofen,               (rcc_ahb1enr_gpiofen_mask)

    .equ rcc_ahb1enr_gpiogen_position,      (0x06)
    .equ rcc_ahb1enr_gpiogen_mask,          (0x01 << rcc_ahb1enr_gpiogen_position)
    .equ rcc_ahb1enr_gpiogen,               (rcc_ahb1enr_gpiogen_mask)

    .equ rcc_ahb1enr_gpiohen_position,      (0x07)
    .equ rcc_ahb1enr_gpiohen_mask,          (0x01 << rcc_ahb1enr_gpiohen_position)
    .equ rcc_ahb1enr_gpiohen,               (rcc_ahb1enr_gpiohen_mask)

    .equ rcc_ahb1enr_crcen_position,        (0x0c)
    .equ rcc_ahb1enr_crcen_mask,            (0x01 << rcc_ahb1enr_crcen_position)
    .equ rcc_ahb1enr_crcen,                 (rcc_ahb1enr_crcen_mask)

    .equ rcc_ahb1enr_bkpsramen_position,    (0x12)
    .equ rcc_ahb1enr_bkpsramen_mask,        (0x01 << rcc_ahb1enr_bkpsramen_position)
    .equ rcc_ahb1enr_bkpsramen,             (rcc_ahb1enr_bkpsramen_mask)

    .equ rcc_ahb1enr_dma1en_position,       (0x15)
    .equ rcc_ahb1enr_dma1en_mask,           (0x01 << rcc_ahb1enr_dma1en_position)
    .equ rcc_ahb1enr_dma1en,                (rcc_ahb1enr_dma1en_mask)

    .equ rcc_ahb1enr_dma2en_position,       (0x16)
    .equ rcc_ahb1enr_dma2en_mask,           (0x01 << rcc_ahb1enr_dma2en_position)
    .equ rcc_ahb1enr_dma2en,                (rcc_ahb1enr_dma2en_mask)

    .equ rcc_ahb1enr_otghsen_position,      (0x1d)
    .equ rcc_ahb1enr_otghsen_mask,          (0x01 << rcc_ahb1enr_otghsen_position)
    .equ rcc_ahb1enr_otghsen,               (rcc_ahb1enr_otghsen_mask)

    .equ rcc_ahb1enr_otghsulpien_position,  (0x1e)
    .equ rcc_ahb1enr_otghsulpien_mask,      (0x01 << rcc_ahb1enr_otghsulpien_position)
    .equ rcc_ahb1enr_otghsulpien,           (rcc_ahb1enr_otghsulpien_mask)


    @-------------------------------------------------------------------------------------------@
    @------------------------------- RCC AHB2EN register fields --------------------------------@
    @-------------------------------------------------------------------------------------------@

    .equ rcc_ahb2enr_dcmien_position,       (0x00)
    .equ rcc_ahb2enr_dcmien_mask,           (0x01 << rcc_ahb2enr_dcmien_position)
    .equ rcc_ahb2enr_dcmien,                (rcc_ahb2enr_dcmien_mask)

    .equ rcc_ahb2enr_otgfsen_position,      (0x07)
    .equ rcc_ahb2enr_otgfsen_mask,          (0x01 << rcc_ahb2enr_otgfsen_position)
    .equ rcc_ahb2enr_otgfsen,               (rcc_ahb2enr_otgfsen_mask)


    @-------------------------------------------------------------------------------------------@
    @------------------------------- RCC AHB3EN register fields --------------------------------@
    @-------------------------------------------------------------------------------------------@

    .equ rcc_ahb3enr_fmcen_position,        (0x00)
    .equ rcc_ahb3enr_fmcen_mask,            (0x01 << rcc_ahb3enr_fmcen_position)
    .equ rcc_ahb3enr_fmcen,                 (rcc_ahb3enr_fmcen_mask)

    .equ rcc_ahb3enr_qspien_position,       (0x01)
    .equ rcc_ahb3enr_qspien_mask,           (0x01 << rcc_ahb3enr_qspien_position)
    .equ rcc_ahb3enr_qspien,                (rcc_ahb3enr_qspien_mask)


    @-------------------------------------------------------------------------------------------@
    @------------------------------- RCC APB1RST register fields -------------------------------@
    @-------------------------------------------------------------------------------------------@

    .equ rcc_apb1rstr_tim2rst_position,     (0x00)
    .equ rcc_apb1rstr_tim2rst_mask,         (0x01 << rcc_apb1rstr_tim2rst_position)
    .equ rcc_apb1rstr_tim2rst,              (rcc_apb1rstr_tim2rst_mask)

    .equ rcc_apb1rstr_tim3rst_position,     (0x01)
    .equ rcc_apb1rstr_tim3rst_mask,         (0x01 << rcc_apb1rstr_tim3rst_position)
    .equ rcc_apb1rstr_tim3rst,              (rcc_apb1rstr_tim3rst_mask)

    .equ rcc_apb1rstr_tim4rst_position,     (0x02)
    .equ rcc_apb1rstr_tim4rst_mask,         (0x01 << rcc_apb1rstr_tim4rst_position)
    .equ rcc_apb1rstr_tim4rst,              (rcc_apb1rstr_tim4rst_mask)

    .equ rcc_apb1rstr_tim5rst_position,     (0x03)
    .equ rcc_apb1rstr_tim5rst_mask,         (0x01 << rcc_apb1rstr_tim5rst_position)
    .equ rcc_apb1rstr_tim5rst,              (rcc_apb1rstr_tim5rst_mask)

    .equ rcc_apb1rstr_tim6rst_position,     (0x04)
    .equ rcc_apb1rstr_tim6rst_mask,         (0x01 << rcc_apb1rstr_tim6rst_position)
    .equ rcc_apb1rstr_tim6rst,              (rcc_apb1rstr_tim6rst_mask)

    .equ rcc_apb1rstr_tim7rst_position,     (0x05)
    .equ rcc_apb1rstr_tim7rst_mask,         (0x01 << rcc_apb1rstr_tim7rst_position)
    .equ rcc_apb1rstr_tim7rst,              (rcc_apb1rstr_tim7rst_mask)

    .equ rcc_apb1rstr_tim12rst_position,    (0x06)
    .equ rcc_apb1rstr_tim12rst_mask,        (0x01 << rcc_apb1rstr_tim12rst_position)
    .equ rcc_apb1rstr_tim12rst,             (rcc_apb1rstr_tim12rst_mask)

    .equ rcc_apb1rstr_tim13rst_position,    (0x07)
    .equ rcc_apb1rstr_tim13rst_mask,        (0x01 << rcc_apb1rstr_tim13rst_position)
    .equ rcc_apb1rstr_tim13rst,             (rcc_apb1rstr_tim13rst_mask)

    .equ rcc_apb1rstr_tim14rst_position,    (0x08)
    .equ rcc_apb1rstr_tim14rst_mask,        (0x01 << rcc_apb1rstr_tim14rst_position)
    .equ rcc_apb1rstr_tim14rst,             (rcc_apb1rstr_tim14rst_mask)

    .equ rcc_apb1rstr_wwdgrst_position,     (0x0b)
    .equ rcc_apb1rstr_wwdgrst_mask,         (0x01 << rcc_apb1rstr_wwdgrst_position)
    .equ rcc_apb1rstr_wwdgrst,              (rcc_apb1rstr_wwdgrst_mask)

    .equ rcc_apb1rstr_spi2rst_position,     (0x0e)
    .equ rcc_apb1rstr_spi2rst_mask,         (0x01 << rcc_apb1rstr_spi2rst_position)
    .equ rcc_apb1rstr_spi2rst,              (rcc_apb1rstr_spi2rst_mask)

    .equ rcc_apb1rstr_spi3rst_position,     (0x0f)
    .equ rcc_apb1rstr_spi3rst_mask,         (0x01 << rcc_apb1rstr_spi3rst_position)
    .equ rcc_apb1rstr_spi3rst,              (rcc_apb1rstr_spi3rst_mask)

    .equ rcc_apb1rstr_spdifrxrst_position,  (0x10)
    .equ rcc_apb1rstr_spdifrxrst_mask,      (0x01 << rcc_apb1rstr_spdifrxrst_position)
    .equ rcc_apb1rstr_spdifrxrst,           (rcc_apb1rstr_spdifrxrst_mask)

    .equ rcc_apb1rstr_usart2rst_position,   (0x11)
    .equ rcc_apb1rstr_usart2rst_mask,       (0x01 << rcc_apb1rstr_usart2rst_position)
    .equ rcc_apb1rstr_usart2rst,            (rcc_apb1rstr_usart2rst_mask)

    .equ rcc_apb1rstr_usart3rst_position,   (0x12)
    .equ rcc_apb1rstr_usart3rst_mask,       (0x01 << rcc_apb1rstr_usart3rst_position)
    .equ rcc_apb1rstr_usart3rst,            (rcc_apb1rstr_usart3rst_mask)

    .equ rcc_apb1rstr_usart4rst_position,   (0x13)
    .equ rcc_apb1rstr_usart4rst_mask,       (0x01 << rcc_apb1rstr_usart4rst_position)
    .equ rcc_apb1rstr_usart4rst,            (rcc_apb1rstr_usart4rst_mask)

    .equ rcc_apb1rstr_usart5rst_position,   (0x14)
    .equ rcc_apb1rstr_usart5rst_mask,       (0x01 << rcc_apb1rstr_usart5rst_position)
    .equ rcc_apb1rstr_usart5rst,            (rcc_apb1rstr_usart5rst_mask)

