PanBabinicz/arm_assembly/share/stm32f446re_constants.inc
    .equ rcc_apb1rstr_i2c1rst_position,     (0x15)
    .equ rcc_apb1rstr_i2c1rst_mask,         (0x01 << rcc_apb1rstr_i2c1rst_position)
    .equ rcc_apb1rstr_i2c1rst,              (rcc_apb1rstr_i2c1rst_mask)

    .equ rcc_apb1rstr_i2c2rst_position,     (0x16)
    .equ rcc_apb1rstr_i2c2rst_mask,         (0x01 << rcc_apb1rstr_i2c2rst_position)
    .equ rcc_apb1rstr_i2c2rst,              (rcc_apb1rstr_i2c2rst_mask)

    .equ rcc_apb1rstr_i2c3rst_position,     (0x17)
    .equ rcc_apb1rstr_i2c3rst_mask,         (0x01 << rcc_apb1rstr_i2c3rst_position)
    .equ rcc_apb1rstr_i2c3rst,              (rcc_apb1rstr_i2c3rst_mask)

    .equ rcc_apb1rstr_ifmpi2c1rst_position, (0x18)
    .equ rcc_apb1rstr_ifmpi2c1rst_mask,     (0x01 << rcc_apb1rstr_ifmpi2c1rst_position)
    .equ rcc_apb1rstr_ifmpi2c1rst,          (rcc_apb1rstr_ifmpi2c1rst_mask)

    .equ rcc_apb1rstr_can1rst_position,     (0x19)
    .equ rcc_apb1rstr_can1rst_mask,         (0x01 << rcc_apb1rstr_can1rst_position)
    .equ rcc_apb1rstr_can1rst,              (rcc_apb1rstr_can1rst_mask)

    .equ rcc_apb1rstr_can2rst_position,     (0x1a)
    .equ rcc_apb1rstr_can2rst_mask,         (0x01 << rcc_apb1rstr_can2rst_position)
    .equ rcc_apb1rstr_can2rst,              (rcc_apb1rstr_can2rst_mask)

    .equ rcc_apb1rstr_cecrst_position,      (0x1b)
    .equ rcc_apb1rstr_cecrst_mask,          (0x01 << rcc_apb1rstr_cecrst_position)
    .equ rcc_apb1rstr_cecrst,               (rcc_apb1rstr_cecrst_mask)

    .equ rcc_apb1rstr_pwrrst_position,      (0x1c)
    .equ rcc_apb1rstr_pwrrst_mask,          (0x01 << rcc_apb1rstr_pwrrst_position)
    .equ rcc_apb1rstr_pwrrst,               (rcc_apb1rstr_pwrrst_mask)

    .equ rcc_apb1rstr_dacrst_position,      (0x1d)
    .equ rcc_apb1rstr_dacrst_mask,          (0x01 << rcc_apb1rstr_dacrst_position)
    .equ rcc_apb1rstr_dacrst,               (rcc_apb1rstr_dacrst_mask)


    @-------------------------------------------------------------------------------------------@
    @------------------------------- RCC APB2RST register fields -------------------------------@
    @-------------------------------------------------------------------------------------------@

    .equ rcc_apb2rstr_tim1rst_position,     (0x00)
    .equ rcc_apb2rstr_tim1rst_mask,         (0x01 << rcc_apb2rstr_tim1rst_position)
    .equ rcc_apb2rstr_tim1rst,              (rcc_apb2rstr_tim1rst_mask)

    .equ rcc_apb2rstr_tim8rst_position,     (0x01)
    .equ rcc_apb2rstr_tim8rst_mask,         (0x01 << rcc_apb2rstr_tim8rst_position)
    .equ rcc_apb2rstr_tim8rst,              (rcc_apb2rstr_tim8rst_mask)

    .equ rcc_apb2rstr_usart1rst_position,   (0x04)
    .equ rcc_apb2rstr_usart1rst_mask,       (0x01 << rcc_apb2rstr_usart1rst_position)
    .equ rcc_apb2rstr_usart1rst,            (rcc_apb2rstr_usart1rst_mask)

    .equ rcc_apb2rstr_usart6rst_position,   (0x05)
    .equ rcc_apb2rstr_usart6rst_mask,       (0x01 << rcc_apb2rstr_usart6rst_position)
    .equ rcc_apb2rstr_usart6rst,            (rcc_apb2rstr_usart6rst_mask)

    .equ rcc_apb2rstr_adcrst_position,      (0x08)
    .equ rcc_apb2rstr_adcrst_mask,          (0x01 << rcc_apb2rstr_adcrst_position)
    .equ rcc_apb2rstr_adcrst,               (rcc_apb2rstr_adcrst_mask)

    .equ rcc_apb2rstr_sdiorst_position,     (0x0b)
    .equ rcc_apb2rstr_sdiorst_mask,         (0x01 << rcc_apb2rstr_sdiorst_position)
    .equ rcc_apb2rstr_sdiorst,              (rcc_apb2rstr_sdiorst_mask)

    .equ rcc_apb2rstr_spi1rst_position,     (0x0c)
    .equ rcc_apb2rstr_spi1rst_mask,         (0x01 << rcc_apb2rstr_spi1rst_position)
    .equ rcc_apb2rstr_spi1rst,              (rcc_apb2rstr_spi1rst_mask)

    .equ rcc_apb2rstr_spi4rst_position,     (0x0d)
    .equ rcc_apb2rstr_spi4rst_mask,         (0x01 << rcc_apb2rstr_spi4rst_position)
    .equ rcc_apb2rstr_spi4rst,              (rcc_apb2rstr_spi4rst_mask)

    .equ rcc_apb2rstr_syscfgrst_position,   (0x0e)
    .equ rcc_apb2rstr_syscfgrst_mask,       (0x01 << rcc_apb2rstr_syscfgrst_position)
    .equ rcc_apb2rstr_syscfgrst,            (rcc_apb2rstr_syscfgrst_mask)

    .equ rcc_apb2rstr_tim9rst_position,     (0x10)
    .equ rcc_apb2rstr_tim9rst_mask,         (0x01 << rcc_apb2rstr_tim9rst_position)
    .equ rcc_apb2rstr_tim9rst,              (rcc_apb2rstr_tim9rst_mask)

    .equ rcc_apb2rstr_tim10rst_position,    (0x11)
    .equ rcc_apb2rstr_tim10rst_mask,        (0x01 << rcc_apb2rstr_tim10rst_position)
    .equ rcc_apb2rstr_tim10rst,             (rcc_apb2rstr_tim10rst_mask)

    .equ rcc_apb2rstr_tim11rst_position,    (0x12)
    .equ rcc_apb2rstr_tim11rst_mask,        (0x01 << rcc_apb2rstr_tim11rst_position)
    .equ rcc_apb2rstr_tim11rst,             (rcc_apb2rstr_tim11rst_mask)

    .equ rcc_apb2rstr_sai1rst_position,     (0x16)
    .equ rcc_apb2rstr_sai1rst_mask,         (0x01 << rcc_apb2rstr_sai1rst_position)
    .equ rcc_apb2rstr_sai1rst,              (rcc_apb2rstr_sai1rst_mask)

    .equ rcc_apb2rstr_sai2rst_position,     (0x17)
    .equ rcc_apb2rstr_sai2rst_mask,         (0x01 << rcc_apb2rstr_sai2rst_position)
    .equ rcc_apb2rstr_sai2rst,              (rcc_apb2rstr_sai2rst_mask)



    TODO:
    rcc_ahb1enr_gpioaen = 0x01
    rcc_ahb1enr_gpioaen = 0x01

    gpiox_moder_base = 0x40020000
    gpiox_moder_input_5 = 0x0 << 10
    gpiox_moder_output_5 = 0x1 << 10
    gpiox_moder_af_5 = 0x2 << 10
    gpiox_moder_analog_5 = 0x3 << 10

    gpiox_bsrr_base = 0x40020018
    gpiox_bsrr_bs5 = 0x1 << 5
    gpiox_bsrr_br5 = 0x1 << 21


    @------------------------------------------------------------------------------------------@
